In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [5]:
df=pd.DataFrame(d)

In [6]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [7]:
df.reindex(["h","k","r"])

    A   B   C
h NaN NaN NaN
k NaN NaN NaN
r NaN NaN NaN

In [8]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna(inplace=True)

In [12]:
df

     A    B  C
0  1.0  5.0  1

In [13]:
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [15]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
df.fillna(value='fill')

      A     B  C
0     1     5  1
1     2  fill  2
2  fill  fill  3

In [19]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

In [20]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3